In [1]:
!python -m pip install cx_Oracle --upgrade

Collecting cx_Oracle
  Downloading cx_Oracle-8.1.0-cp38-cp38-win_amd64.whl (212 kB)
Installing collected packages: cx-Oracle
Successfully installed cx-Oracle-8.1.0

In [14]:
import cx_Oracle
import pandas as pd

In [28]:
db = cx_Oracle.connect("CABA_PDB","oracle","localhost:1521/xepdb1")

In [36]:

cursor = db.cursor()
cursor.execute("select *from BOOK")
x= cursor.fetchall()
df = pd.DataFrame(x)
df.head()

   0        1      2        3
0  1   축구의 역사   굿스포츠   7000.0
1  2  축구아는 여자    나무수  13000.0
2  3   축구의 이해  대한미디어  22000.0
3  4   골프 바이블  대한미디어  35000.0
4  5    피겨 교본   굿스포츠   8000.0

In [38]:
cursor.execute("""select column_name from user_tab_columns where table_name = 'BOOK'
""")
col = cursor.fetchall()
df.columns = col
col

[('BOOKID',), ('BOOKNAME',), ('PUBLISHER',), ('PRICE',)]

In [41]:
df.columns = list1
df.head()

   BOOKID BOOKNAME PUBLISHER    PRICE
0       1   축구의 역사      굿스포츠   7000.0
1       2  축구아는 여자       나무수  13000.0
2       3   축구의 이해     대한미디어  22000.0
3       4   골프 바이블     대한미디어  35000.0
4       5    피겨 교본      굿스포츠   8000.0

In [40]:
list1 = []
for i in col:
    for j in i:
        list1.append(j)
print (list1)

['BOOKID', 'BOOKNAME', 'PUBLISHER', 'PRICE']

In [34]:
cursor.close()
db.commit()